import codecs

txt = 'INSERT INTO currency(code, name, code_en, units, course) VALUES'

code = ["036", "944", "051", "933", "410", "784", "840",
        "978", "818", "356", "398", "156", "985", "949",
        "980", "203", "392", "643"]
name = ["Австралийский доллар", "Азербайджанский манат", 
        "Армянских драмов", "Белорусский рубль", 
        "Вон Республики Корея", "Дирхам ОАЭ", "Доллар США",
        "Евро", "Египетских фунтов", "Индийских рупий", 
        "Казахстанских тенге", "Китайский юань","Польский злотый", 
        "Турецких лир", "Украинских гривен", "Чешских крон", 
        "Японских иен", "Российский рубль"]
code_en = ["AZN", "AZN", "AMD", "BYN", "KRW", "AED", "USD",
        "EUR", "EGP", "INR", "KZT", "CNY", "PLN", "TRY",
        "UAH", "CZK", "JPY", "RUB"]
units = [1, 1, 100, 1, 1000, 1, 1,
        1, 10, 10, 100, 1, 1, 10,
        10, 10, 100, 1, 1]
course = [62.3530, 54.0817, 22.6663, 28.6986, 70.5594, 25.0344, 
        91.9389, 101.2863, 29.7602, 11.0530, 20.1184, 12.8598,
        23.3715, 31.5768, 24.4542, 41.2282, 64.7868, 1]
for c, n, ce, u, cs in zip(code, name, code_en, units, course): 
    txt += f''' ('{c}','{n}','{ce}',{u},{cs}),'''

txt = txt[:len(txt)-1] + ';'

with codecs.open("2_currency.txt", "w", "utf-16") as output:
    output.write(txt)
